[
  {"year":2008, "month":12, "day":13, "what":"[Tame Impala](https://en.wikipedia.org/wiki/Tame_Impala) performs at Meredith Music Festival. Stu is in the crowd, and is so inspired that he went home to start a band."}
, {"year":2009, "month":12, "day":18, "what": "[Thee Oh Sees](https://en.wikipedia.org/wiki/Osees) perform in Melbourne; the audience is mostly made up of future King Gizzard members who were all heavily inspired by the show."}
, {"year":2013, "month":10, "day": 9, "what": "King Gizzard win the first Carlton Dry Global Music Grant, allowing them to tour internationally for the first time (starting in April 2014)."}
, {"year":2016, "month":11, "day":23, "what": "King Gizzard win the Best Hard Rock/Heavy Metal Album ARIA Award for _Nonagon Infinity_. (Other nominees included: Hellions, Parkway Drive, The Amity Affliction, and Twelve Foot Ninja.)"}
, {"year":2017, "month": 2, "day": 3, "what": "Stu & Eric acknowledge the Gizzverse for the first time in a radio interview on Triple J: \"[The albums] all exist in this parallel universe and they’re maybe from different times and different places but they all can co-exist in a meaningful way.\""}
, {"year":2018, "month": 9, "day":24, "what": "The Flightless Records website crashes under the demand of pre-orders for the vinyl re-pressing of the band's first five full-length albums."}
, {"year":2020, "month": 8, "day":24, "what": "Eric Moore announces his departure from the band to focus on Flightless Records full time, and the band return to self-publishing."}
, {"year":2020, "month":11, "day":25, "what": "King Gizzard win the Best Hard Rock/Heavy Metal Album ARIA Award for _Chunky Shrapnel_. (Other nominees included: Parkway Drive, Polaris, The Amity Affliction, and The Chats.)"}
, {"year":2020, "month":12, "day":25, "what": "The Official Bootlegger program is launched."}
, {"year":2022, "month": 6, "day":16, "what": "King Gizzard win the first Environmental Music Prize, and donate the winnings to The Wilderness Society."}
, {"year":2022, "month":10, "day":19, "what": "[KGLW.net](https://kglw.net) launches!"}
, {"year":2022, "month":10, "day":26, "what": "On-demand streaming release of the short film [Sleeping Monster](https://www.youtube.com/watch?v=-4wn6PUskhI)."}
, {"year":0, "month":0, "day":0, "what": ""}
]
